/*
D - Dependency Inversion Principle - принцип инверсии зависимостей. Модули верхнего уровня не должны зависеть от модулей нижнего уровня.
И те, и другие должны зависеть от абстракции. Абстракции не должны зависеть от деталей. Детали должны зависеть от абстракций.

Допустим мы пишем приложение для магазина и решаем вопросы с проведением оплат.
Вначале это просто небольшой магазин, где оплата происходит только за наличные.
Создаем класс Cash и класс Shop.
 */

package HomeWork3.DependencyInversionPrinciple;

public class Main {
}
